# Train and Test Data

In [1]:
# Importing the libraries
import pandas as pd
import seaborn as sns

In [2]:
# Importing the dataset
dataset = sns.load_dataset('titanic')
dataset.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
datasettoworkon = dataset[['survived', 'pclass','age', 'parch']]
datasettoworkon.head()

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [4]:
datasettoworkon_new = datasettoworkon.fillna(datasettoworkon.mean())
datasettoworkon_new.head()

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [5]:
datasettoworkon_new.isnull().sum().sum()

0

In [6]:
# X = Independent Variables
# y = Dependent Variables
X = datasettoworkon_new.drop('survived', axis=1)
y = datasettoworkon_new['survived']
X.shape,y.shape

((891, 3), (891,))

In [7]:
# Importing train_test_split library and Splitting the dataset into the Training set and Test set
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [8]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((712, 3), (179, 3), (712,), (179,))

In [9]:
X_train

     pclass        age  parch
140       3  29.699118      2
439       2  31.000000      0
817       2  31.000000      1
378       3  20.000000      0
491       3  21.000000      0
..      ...        ...    ...
835       1  39.000000      1
192       3  19.000000      0
629       3  29.699118      0
559       3  36.000000      0
684       2  60.000000      1

[712 rows x 3 columns]

### Prepared by RITURAJ RAMAN